alert(5 > 4); // true.
alert("apple" > "pineapple"); // false. ასოების მათემატიკური მნიშვნელობის დათვლის გარეშე ჩანს რომ "apple" ორივე სიტყვაშია გამოყენებული,
alert("2" > "12"); // false. აქაც ზემოხსენებულიდან ვფიქრობ ლოგიკურად.
// true ყოფილა :დ. გამოდის რომ რიცხვებთან მიმართებაში 2იანი რომ წერია პირველი ის გადაწონის?
alert(undefined == null); // true. რადგან ორი პლიუსია ჯავასკრიპტში ეს ორი ელემენტი ერთმანეთის ტოლია.
alert(undefined === null); // false. მკაცრად ტიპიზირებულია "===", შესაბამისად ტიპები განსხვავდებიან.
alert(null == " 0 "); // false. null არ უდრის სტრინგს, არამედ უდრის 0 number-ს ისიც ორ ტოლობაში. თან აქ სფეისებიც გამოყენებულია სტრინგში არავითარ შემთხვევაში არ უნდა იყოს true :დ.
alert(null === +"0"); // false. სტრინგი ნამბერში გადადის მაგრამ აქაც მკაცრად ტიპიზირებულია.
